----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 110, 110]           1,728
       BatchNorm2d-2         [-1, 64, 110, 110]             128
             PReLU-3         [-1, 64, 110, 110]               1
         MaxPool2d-4           [-1, 64, 55, 55]               0
       BatchNorm2d-5           [-1, 64, 55, 55]             128
            Conv2d-6           [-1, 64, 55, 55]          36,864
       BatchNorm2d-7           [-1, 64, 55, 55]             128
             PReLU-8           [-1, 64, 55, 55]               1
            Conv2d-9           [-1, 64, 55, 55]          36,864
      BatchNorm2d-10           [-1, 64, 55, 55]             128
AdaptiveAvgPool2d-11             [-1, 64, 1, 1]               0
           Linear-12                    [-1, 4]             260
            PReLU-13                    [-1, 4]               1
           Linear-14                   [-1, 64]             320
          Sigmoid-15                   [-1, 64]               0
          SEBlock-16           [-1, 64, 55, 55]               0
            PReLU-17           [-1, 64, 55, 55]               1
          IRBlock-18           [-1, 64, 55, 55]               0
      BatchNorm2d-19           [-1, 64, 55, 55]             128
           Conv2d-20           [-1, 64, 55, 55]          36,864
      BatchNorm2d-21           [-1, 64, 55, 55]             128
            PReLU-22           [-1, 64, 55, 55]               1
           Conv2d-23           [-1, 64, 55, 55]          36,864
      BatchNorm2d-24           [-1, 64, 55, 55]             128
AdaptiveAvgPool2d-25             [-1, 64, 1, 1]               0
           Linear-26                    [-1, 4]             260
            PReLU-27                    [-1, 4]               1
           Linear-28                   [-1, 64]             320
          Sigmoid-29                   [-1, 64]               0
          SEBlock-30           [-1, 64, 55, 55]               0
            PReLU-31           [-1, 64, 55, 55]               1
          IRBlock-32           [-1, 64, 55, 55]               0
      BatchNorm2d-33           [-1, 64, 55, 55]             128
           Conv2d-34           [-1, 64, 55, 55]          36,864
      BatchNorm2d-35           [-1, 64, 55, 55]             128
            PReLU-36           [-1, 64, 55, 55]               1
           Conv2d-37           [-1, 64, 55, 55]          36,864
      BatchNorm2d-38           [-1, 64, 55, 55]             128
AdaptiveAvgPool2d-39             [-1, 64, 1, 1]               0
           Linear-40                    [-1, 4]             260
            PReLU-41                    [-1, 4]               1
           Linear-42                   [-1, 64]             320
          Sigmoid-43                   [-1, 64]               0
          SEBlock-44           [-1, 64, 55, 55]               0
            PReLU-45           [-1, 64, 55, 55]               1
          IRBlock-46           [-1, 64, 55, 55]               0
      BatchNorm2d-47           [-1, 64, 55, 55]             128
           Conv2d-48           [-1, 64, 55, 55]          36,864
      BatchNorm2d-49           [-1, 64, 55, 55]             128
            PReLU-50           [-1, 64, 55, 55]               1
           Conv2d-51          [-1, 128, 28, 28]          73,728
      BatchNorm2d-52          [-1, 128, 28, 28]             256
AdaptiveAvgPool2d-53            [-1, 128, 1, 1]               0
           Linear-54                    [-1, 8]           1,032
            PReLU-55                    [-1, 8]               1
           Linear-56                  [-1, 128]           1,152
          Sigmoid-57                  [-1, 128]               0
          SEBlock-58          [-1, 128, 28, 28]               0
           Conv2d-59          [-1, 128, 28, 28]           8,192
      BatchNorm2d-60          [-1, 128, 28, 28]             256
            PReLU-61          [-1, 128, 28, 28]               1
          IRBlock-62          [-1, 128, 28, 28]               0
      BatchNorm2d-63          [-1, 128, 28, 28]             256
           Conv2d-64          [-1, 128, 28, 28]         147,456
      BatchNorm2d-65          [-1, 128, 28, 28]             256
            PReLU-66          [-1, 128, 28, 28]               1
           Conv2d-67          [-1, 128, 28, 28]         147,456
      BatchNorm2d-68          [-1, 128, 28, 28]             256
AdaptiveAvgPool2d-69            [-1, 128, 1, 1]               0
           Linear-70                    [-1, 8]           1,032
            PReLU-71                    [-1, 8]               1
           Linear-72                  [-1, 128]           1,152
          Sigmoid-73                  [-1, 128]               0
          SEBlock-74          [-1, 128, 28, 28]               0
            PReLU-75          [-1, 128, 28, 28]               1
          IRBlock-76          [-1, 128, 28, 28]               0
      BatchNorm2d-77          [-1, 128, 28, 28]             256
           Conv2d-78          [-1, 128, 28, 28]         147,456
      BatchNorm2d-79          [-1, 128, 28, 28]             256
            PReLU-80          [-1, 128, 28, 28]               1
           Conv2d-81          [-1, 128, 28, 28]         147,456
      BatchNorm2d-82          [-1, 128, 28, 28]             256
AdaptiveAvgPool2d-83            [-1, 128, 1, 1]               0
           Linear-84                    [-1, 8]           1,032
            PReLU-85                    [-1, 8]               1
           Linear-86                  [-1, 128]           1,152
          Sigmoid-87                  [-1, 128]               0
          SEBlock-88          [-1, 128, 28, 28]               0
            PReLU-89          [-1, 128, 28, 28]               1
          IRBlock-90          [-1, 128, 28, 28]               0
      BatchNorm2d-91          [-1, 128, 28, 28]             256
           Conv2d-92          [-1, 128, 28, 28]         147,456
      BatchNorm2d-93          [-1, 128, 28, 28]             256
            PReLU-94          [-1, 128, 28, 28]               1
           Conv2d-95          [-1, 128, 28, 28]         147,456
      BatchNorm2d-96          [-1, 128, 28, 28]             256
AdaptiveAvgPool2d-97            [-1, 128, 1, 1]               0
           Linear-98                    [-1, 8]           1,032
            PReLU-99                    [-1, 8]               1
          Linear-100                  [-1, 128]           1,152
         Sigmoid-101                  [-1, 128]               0
         SEBlock-102          [-1, 128, 28, 28]               0
           PReLU-103          [-1, 128, 28, 28]               1
         IRBlock-104          [-1, 128, 28, 28]               0
     BatchNorm2d-105          [-1, 128, 28, 28]             256
          Conv2d-106          [-1, 128, 28, 28]         147,456
     BatchNorm2d-107          [-1, 128, 28, 28]             256
           PReLU-108          [-1, 128, 28, 28]               1
          Conv2d-109          [-1, 256, 14, 14]         294,912
     BatchNorm2d-110          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-111            [-1, 256, 1, 1]               0
          Linear-112                   [-1, 16]           4,112
           PReLU-113                   [-1, 16]               1
          Linear-114                  [-1, 256]           4,352
         Sigmoid-115                  [-1, 256]               0
         SEBlock-116          [-1, 256, 14, 14]               0
          Conv2d-117          [-1, 256, 14, 14]          32,768
     BatchNorm2d-118          [-1, 256, 14, 14]             512
           PReLU-119          [-1, 256, 14, 14]               1
         IRBlock-120          [-1, 256, 14, 14]               0
     BatchNorm2d-121          [-1, 256, 14, 14]             512
          Conv2d-122          [-1, 256, 14, 14]         589,824
     BatchNorm2d-123          [-1, 256, 14, 14]             512
           PReLU-124          [-1, 256, 14, 14]               1
          Conv2d-125          [-1, 256, 14, 14]         589,824
     BatchNorm2d-126          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-127            [-1, 256, 1, 1]               0
          Linear-128                   [-1, 16]           4,112
           PReLU-129                   [-1, 16]               1
          Linear-130                  [-1, 256]           4,352
         Sigmoid-131                  [-1, 256]               0
         SEBlock-132          [-1, 256, 14, 14]               0
           PReLU-133          [-1, 256, 14, 14]               1
         IRBlock-134          [-1, 256, 14, 14]               0
     BatchNorm2d-135          [-1, 256, 14, 14]             512
          Conv2d-136          [-1, 256, 14, 14]         589,824
     BatchNorm2d-137          [-1, 256, 14, 14]             512
           PReLU-138          [-1, 256, 14, 14]               1
          Conv2d-139          [-1, 256, 14, 14]         589,824
     BatchNorm2d-140          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-141            [-1, 256, 1, 1]               0
          Linear-142                   [-1, 16]           4,112
           PReLU-143                   [-1, 16]               1
          Linear-144                  [-1, 256]           4,352
         Sigmoid-145                  [-1, 256]               0
         SEBlock-146          [-1, 256, 14, 14]               0
           PReLU-147          [-1, 256, 14, 14]               1
         IRBlock-148          [-1, 256, 14, 14]               0
     BatchNorm2d-149          [-1, 256, 14, 14]             512
          Conv2d-150          [-1, 256, 14, 14]         589,824
     BatchNorm2d-151          [-1, 256, 14, 14]             512
           PReLU-152          [-1, 256, 14, 14]               1
          Conv2d-153          [-1, 256, 14, 14]         589,824
     BatchNorm2d-154          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-155            [-1, 256, 1, 1]               0
          Linear-156                   [-1, 16]           4,112
           PReLU-157                   [-1, 16]               1
          Linear-158                  [-1, 256]           4,352
         Sigmoid-159                  [-1, 256]               0
         SEBlock-160          [-1, 256, 14, 14]               0
           PReLU-161          [-1, 256, 14, 14]               1
         IRBlock-162          [-1, 256, 14, 14]               0
     BatchNorm2d-163          [-1, 256, 14, 14]             512
          Conv2d-164          [-1, 256, 14, 14]         589,824
     BatchNorm2d-165          [-1, 256, 14, 14]             512
           PReLU-166          [-1, 256, 14, 14]               1
          Conv2d-167          [-1, 256, 14, 14]         589,824
     BatchNorm2d-168          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-169            [-1, 256, 1, 1]               0
          Linear-170                   [-1, 16]           4,112
           PReLU-171                   [-1, 16]               1
          Linear-172                  [-1, 256]           4,352
         Sigmoid-173                  [-1, 256]               0
         SEBlock-174          [-1, 256, 14, 14]               0
           PReLU-175          [-1, 256, 14, 14]               1
         IRBlock-176          [-1, 256, 14, 14]               0
     BatchNorm2d-177          [-1, 256, 14, 14]             512
          Conv2d-178          [-1, 256, 14, 14]         589,824
     BatchNorm2d-179          [-1, 256, 14, 14]             512
           PReLU-180          [-1, 256, 14, 14]               1
          Conv2d-181          [-1, 256, 14, 14]         589,824
     BatchNorm2d-182          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-183            [-1, 256, 1, 1]               0
          Linear-184                   [-1, 16]           4,112
           PReLU-185                   [-1, 16]               1
          Linear-186                  [-1, 256]           4,352
         Sigmoid-187                  [-1, 256]               0
         SEBlock-188          [-1, 256, 14, 14]               0
           PReLU-189          [-1, 256, 14, 14]               1
         IRBlock-190          [-1, 256, 14, 14]               0
     BatchNorm2d-191          [-1, 256, 14, 14]             512
          Conv2d-192          [-1, 256, 14, 14]         589,824
     BatchNorm2d-193          [-1, 256, 14, 14]             512
           PReLU-194          [-1, 256, 14, 14]               1
          Conv2d-195          [-1, 256, 14, 14]         589,824
     BatchNorm2d-196          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-197            [-1, 256, 1, 1]               0
          Linear-198                   [-1, 16]           4,112
           PReLU-199                   [-1, 16]               1
          Linear-200                  [-1, 256]           4,352
         Sigmoid-201                  [-1, 256]               0
         SEBlock-202          [-1, 256, 14, 14]               0
           PReLU-203          [-1, 256, 14, 14]               1
         IRBlock-204          [-1, 256, 14, 14]               0
     BatchNorm2d-205          [-1, 256, 14, 14]             512
          Conv2d-206          [-1, 256, 14, 14]         589,824
     BatchNorm2d-207          [-1, 256, 14, 14]             512
           PReLU-208          [-1, 256, 14, 14]               1
          Conv2d-209          [-1, 256, 14, 14]         589,824
     BatchNorm2d-210          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-211            [-1, 256, 1, 1]               0
          Linear-212                   [-1, 16]           4,112
           PReLU-213                   [-1, 16]               1
          Linear-214                  [-1, 256]           4,352
         Sigmoid-215                  [-1, 256]               0
         SEBlock-216          [-1, 256, 14, 14]               0
           PReLU-217          [-1, 256, 14, 14]               1
         IRBlock-218          [-1, 256, 14, 14]               0
     BatchNorm2d-219          [-1, 256, 14, 14]             512
          Conv2d-220          [-1, 256, 14, 14]         589,824
     BatchNorm2d-221          [-1, 256, 14, 14]             512
           PReLU-222          [-1, 256, 14, 14]               1
          Conv2d-223          [-1, 256, 14, 14]         589,824
     BatchNorm2d-224          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-225            [-1, 256, 1, 1]               0
          Linear-226                   [-1, 16]           4,112
           PReLU-227                   [-1, 16]               1
          Linear-228                  [-1, 256]           4,352
         Sigmoid-229                  [-1, 256]               0
         SEBlock-230          [-1, 256, 14, 14]               0
           PReLU-231          [-1, 256, 14, 14]               1
         IRBlock-232          [-1, 256, 14, 14]               0
     BatchNorm2d-233          [-1, 256, 14, 14]             512
          Conv2d-234          [-1, 256, 14, 14]         589,824
     BatchNorm2d-235          [-1, 256, 14, 14]             512
           PReLU-236          [-1, 256, 14, 14]               1
          Conv2d-237          [-1, 256, 14, 14]         589,824
     BatchNorm2d-238          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-239            [-1, 256, 1, 1]               0
          Linear-240                   [-1, 16]           4,112
           PReLU-241                   [-1, 16]               1
          Linear-242                  [-1, 256]           4,352
         Sigmoid-243                  [-1, 256]               0
         SEBlock-244          [-1, 256, 14, 14]               0
           PReLU-245          [-1, 256, 14, 14]               1
         IRBlock-246          [-1, 256, 14, 14]               0
     BatchNorm2d-247          [-1, 256, 14, 14]             512
          Conv2d-248          [-1, 256, 14, 14]         589,824
     BatchNorm2d-249          [-1, 256, 14, 14]             512
           PReLU-250          [-1, 256, 14, 14]               1
          Conv2d-251          [-1, 256, 14, 14]         589,824
     BatchNorm2d-252          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-253            [-1, 256, 1, 1]               0
          Linear-254                   [-1, 16]           4,112
           PReLU-255                   [-1, 16]               1
          Linear-256                  [-1, 256]           4,352
         Sigmoid-257                  [-1, 256]               0
         SEBlock-258          [-1, 256, 14, 14]               0
           PReLU-259          [-1, 256, 14, 14]               1
         IRBlock-260          [-1, 256, 14, 14]               0
     BatchNorm2d-261          [-1, 256, 14, 14]             512
          Conv2d-262          [-1, 256, 14, 14]         589,824
     BatchNorm2d-263          [-1, 256, 14, 14]             512
           PReLU-264          [-1, 256, 14, 14]               1
          Conv2d-265          [-1, 256, 14, 14]         589,824
     BatchNorm2d-266          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-267            [-1, 256, 1, 1]               0
          Linear-268                   [-1, 16]           4,112
           PReLU-269                   [-1, 16]               1
          Linear-270                  [-1, 256]           4,352
         Sigmoid-271                  [-1, 256]               0
         SEBlock-272          [-1, 256, 14, 14]               0
           PReLU-273          [-1, 256, 14, 14]               1
         IRBlock-274          [-1, 256, 14, 14]               0
     BatchNorm2d-275          [-1, 256, 14, 14]             512
          Conv2d-276          [-1, 256, 14, 14]         589,824
     BatchNorm2d-277          [-1, 256, 14, 14]             512
           PReLU-278          [-1, 256, 14, 14]               1
          Conv2d-279          [-1, 256, 14, 14]         589,824
     BatchNorm2d-280          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-281            [-1, 256, 1, 1]               0
          Linear-282                   [-1, 16]           4,112
           PReLU-283                   [-1, 16]               1
          Linear-284                  [-1, 256]           4,352
         Sigmoid-285                  [-1, 256]               0
         SEBlock-286          [-1, 256, 14, 14]               0
           PReLU-287          [-1, 256, 14, 14]               1
         IRBlock-288          [-1, 256, 14, 14]               0
     BatchNorm2d-289          [-1, 256, 14, 14]             512
          Conv2d-290          [-1, 256, 14, 14]         589,824
     BatchNorm2d-291          [-1, 256, 14, 14]             512
           PReLU-292          [-1, 256, 14, 14]               1
          Conv2d-293          [-1, 256, 14, 14]         589,824
     BatchNorm2d-294          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-295            [-1, 256, 1, 1]               0
          Linear-296                   [-1, 16]           4,112
           PReLU-297                   [-1, 16]               1
          Linear-298                  [-1, 256]           4,352
         Sigmoid-299                  [-1, 256]               0
         SEBlock-300          [-1, 256, 14, 14]               0
           PReLU-301          [-1, 256, 14, 14]               1
         IRBlock-302          [-1, 256, 14, 14]               0
     BatchNorm2d-303          [-1, 256, 14, 14]             512
          Conv2d-304          [-1, 256, 14, 14]         589,824
     BatchNorm2d-305          [-1, 256, 14, 14]             512
           PReLU-306          [-1, 256, 14, 14]               1
          Conv2d-307          [-1, 256, 14, 14]         589,824
     BatchNorm2d-308          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-309            [-1, 256, 1, 1]               0
          Linear-310                   [-1, 16]           4,112
           PReLU-311                   [-1, 16]               1
          Linear-312                  [-1, 256]           4,352
         Sigmoid-313                  [-1, 256]               0
         SEBlock-314          [-1, 256, 14, 14]               0
           PReLU-315          [-1, 256, 14, 14]               1
         IRBlock-316          [-1, 256, 14, 14]               0
     BatchNorm2d-317          [-1, 256, 14, 14]             512
          Conv2d-318          [-1, 256, 14, 14]         589,824
     BatchNorm2d-319          [-1, 256, 14, 14]             512
           PReLU-320          [-1, 256, 14, 14]               1
          Conv2d-321          [-1, 256, 14, 14]         589,824
     BatchNorm2d-322          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-323            [-1, 256, 1, 1]               0
          Linear-324                   [-1, 16]           4,112
           PReLU-325                   [-1, 16]               1
          Linear-326                  [-1, 256]           4,352
         Sigmoid-327                  [-1, 256]               0
         SEBlock-328          [-1, 256, 14, 14]               0
           PReLU-329          [-1, 256, 14, 14]               1
         IRBlock-330          [-1, 256, 14, 14]               0
     BatchNorm2d-331          [-1, 256, 14, 14]             512
          Conv2d-332          [-1, 256, 14, 14]         589,824
     BatchNorm2d-333          [-1, 256, 14, 14]             512
           PReLU-334          [-1, 256, 14, 14]               1
          Conv2d-335          [-1, 256, 14, 14]         589,824
     BatchNorm2d-336          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-337            [-1, 256, 1, 1]               0
          Linear-338                   [-1, 16]           4,112
           PReLU-339                   [-1, 16]               1
          Linear-340                  [-1, 256]           4,352
         Sigmoid-341                  [-1, 256]               0
         SEBlock-342          [-1, 256, 14, 14]               0
           PReLU-343          [-1, 256, 14, 14]               1
         IRBlock-344          [-1, 256, 14, 14]               0
     BatchNorm2d-345          [-1, 256, 14, 14]             512
          Conv2d-346          [-1, 256, 14, 14]         589,824
     BatchNorm2d-347          [-1, 256, 14, 14]             512
           PReLU-348          [-1, 256, 14, 14]               1
          Conv2d-349          [-1, 256, 14, 14]         589,824
     BatchNorm2d-350          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-351            [-1, 256, 1, 1]               0
          Linear-352                   [-1, 16]           4,112
           PReLU-353                   [-1, 16]               1
          Linear-354                  [-1, 256]           4,352
         Sigmoid-355                  [-1, 256]               0
         SEBlock-356          [-1, 256, 14, 14]               0
           PReLU-357          [-1, 256, 14, 14]               1
         IRBlock-358          [-1, 256, 14, 14]               0
     BatchNorm2d-359          [-1, 256, 14, 14]             512
          Conv2d-360          [-1, 256, 14, 14]         589,824
     BatchNorm2d-361          [-1, 256, 14, 14]             512
           PReLU-362          [-1, 256, 14, 14]               1
          Conv2d-363          [-1, 256, 14, 14]         589,824
     BatchNorm2d-364          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-365            [-1, 256, 1, 1]               0
          Linear-366                   [-1, 16]           4,112
           PReLU-367                   [-1, 16]               1
          Linear-368                  [-1, 256]           4,352
         Sigmoid-369                  [-1, 256]               0
         SEBlock-370          [-1, 256, 14, 14]               0
           PReLU-371          [-1, 256, 14, 14]               1
         IRBlock-372          [-1, 256, 14, 14]               0
     BatchNorm2d-373          [-1, 256, 14, 14]             512
          Conv2d-374          [-1, 256, 14, 14]         589,824
     BatchNorm2d-375          [-1, 256, 14, 14]             512
           PReLU-376          [-1, 256, 14, 14]               1
          Conv2d-377          [-1, 256, 14, 14]         589,824
     BatchNorm2d-378          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-379            [-1, 256, 1, 1]               0
          Linear-380                   [-1, 16]           4,112
           PReLU-381                   [-1, 16]               1
          Linear-382                  [-1, 256]           4,352
         Sigmoid-383                  [-1, 256]               0
         SEBlock-384          [-1, 256, 14, 14]               0
           PReLU-385          [-1, 256, 14, 14]               1
         IRBlock-386          [-1, 256, 14, 14]               0
     BatchNorm2d-387          [-1, 256, 14, 14]             512
          Conv2d-388          [-1, 256, 14, 14]         589,824
     BatchNorm2d-389          [-1, 256, 14, 14]             512
           PReLU-390          [-1, 256, 14, 14]               1
          Conv2d-391          [-1, 256, 14, 14]         589,824
     BatchNorm2d-392          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-393            [-1, 256, 1, 1]               0
          Linear-394                   [-1, 16]           4,112
           PReLU-395                   [-1, 16]               1
          Linear-396                  [-1, 256]           4,352
         Sigmoid-397                  [-1, 256]               0
         SEBlock-398          [-1, 256, 14, 14]               0
           PReLU-399          [-1, 256, 14, 14]               1
         IRBlock-400          [-1, 256, 14, 14]               0
     BatchNorm2d-401          [-1, 256, 14, 14]             512
          Conv2d-402          [-1, 256, 14, 14]         589,824
     BatchNorm2d-403          [-1, 256, 14, 14]             512
           PReLU-404          [-1, 256, 14, 14]               1
          Conv2d-405          [-1, 256, 14, 14]         589,824
     BatchNorm2d-406          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-407            [-1, 256, 1, 1]               0
          Linear-408                   [-1, 16]           4,112
           PReLU-409                   [-1, 16]               1
          Linear-410                  [-1, 256]           4,352
         Sigmoid-411                  [-1, 256]               0
         SEBlock-412          [-1, 256, 14, 14]               0
           PReLU-413          [-1, 256, 14, 14]               1
         IRBlock-414          [-1, 256, 14, 14]               0
     BatchNorm2d-415          [-1, 256, 14, 14]             512
          Conv2d-416          [-1, 256, 14, 14]         589,824
     BatchNorm2d-417          [-1, 256, 14, 14]             512
           PReLU-418          [-1, 256, 14, 14]               1
          Conv2d-419          [-1, 256, 14, 14]         589,824
     BatchNorm2d-420          [-1, 256, 14, 14]             512
AdaptiveAvgPool2d-421            [-1, 256, 1, 1]               0
          Linear-422                   [-1, 16]           4,112
           PReLU-423                   [-1, 16]               1
          Linear-424                  [-1, 256]           4,352
         Sigmoid-425                  [-1, 256]               0
         SEBlock-426          [-1, 256, 14, 14]               0
           PReLU-427          [-1, 256, 14, 14]               1
         IRBlock-428          [-1, 256, 14, 14]               0
     BatchNorm2d-429          [-1, 256, 14, 14]             512
          Conv2d-430          [-1, 256, 14, 14]         589,824
     BatchNorm2d-431          [-1, 256, 14, 14]             512
           PReLU-432          [-1, 256, 14, 14]               1
          Conv2d-433            [-1, 512, 7, 7]       1,179,648
     BatchNorm2d-434            [-1, 512, 7, 7]           1,024
AdaptiveAvgPool2d-435            [-1, 512, 1, 1]               0
          Linear-436                   [-1, 32]          16,416
           PReLU-437                   [-1, 32]               1
          Linear-438                  [-1, 512]          16,896
         Sigmoid-439                  [-1, 512]               0
         SEBlock-440            [-1, 512, 7, 7]               0
          Conv2d-441            [-1, 512, 7, 7]         131,072
     BatchNorm2d-442            [-1, 512, 7, 7]           1,024
           PReLU-443            [-1, 512, 7, 7]               1
         IRBlock-444            [-1, 512, 7, 7]               0
     BatchNorm2d-445            [-1, 512, 7, 7]           1,024
          Conv2d-446            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-447            [-1, 512, 7, 7]           1,024
           PReLU-448            [-1, 512, 7, 7]               1
          Conv2d-449            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-450            [-1, 512, 7, 7]           1,024
AdaptiveAvgPool2d-451            [-1, 512, 1, 1]               0
          Linear-452                   [-1, 32]          16,416
           PReLU-453                   [-1, 32]               1
          Linear-454                  [-1, 512]          16,896
         Sigmoid-455                  [-1, 512]               0
         SEBlock-456            [-1, 512, 7, 7]               0
           PReLU-457            [-1, 512, 7, 7]               1
         IRBlock-458            [-1, 512, 7, 7]               0
     BatchNorm2d-459            [-1, 512, 7, 7]           1,024
          Conv2d-460            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-461            [-1, 512, 7, 7]           1,024
           PReLU-462            [-1, 512, 7, 7]               1
          Conv2d-463            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-464            [-1, 512, 7, 7]           1,024
AdaptiveAvgPool2d-465            [-1, 512, 1, 1]               0
          Linear-466                   [-1, 32]          16,416
           PReLU-467                   [-1, 32]               1
          Linear-468                  [-1, 512]          16,896
         Sigmoid-469                  [-1, 512]               0
         SEBlock-470            [-1, 512, 7, 7]               0
           PReLU-471            [-1, 512, 7, 7]               1
         IRBlock-472            [-1, 512, 7, 7]               0
     BatchNorm2d-473            [-1, 512, 7, 7]           1,024
         Dropout-474            [-1, 512, 7, 7]               0
          Linear-475                  [-1, 512]      12,845,568
     BatchNorm1d-476                  [-1, 512]           1,024
================================================================
Total params: 52,193,248
Trainable params: 52,193,248
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.14
Forward/backward pass size (MB): 179.46
Params size (MB): 199.10
Estimated Total Size (MB): 378.71
----------------------------------------------------------------
