----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
   ReflectionPad2d-1          [-1, 3, 230, 230]               0
            Conv2d-2         [-1, 64, 224, 224]           9,472
       BatchNorm2d-3         [-1, 64, 224, 224]             128
              ReLU-4         [-1, 64, 224, 224]               0
              ReLU-5         [-1, 64, 224, 224]               0
              ReLU-6         [-1, 64, 224, 224]               0
              ReLU-7         [-1, 64, 224, 224]               0
              ReLU-8         [-1, 64, 224, 224]               0
              ReLU-9         [-1, 64, 224, 224]               0
             ReLU-10         [-1, 64, 224, 224]               0
             ReLU-11         [-1, 64, 224, 224]               0
             ReLU-12         [-1, 64, 224, 224]               0
             ReLU-13         [-1, 64, 224, 224]               0
             ReLU-14         [-1, 64, 224, 224]               0
             ReLU-15         [-1, 64, 224, 224]               0
             ReLU-16         [-1, 64, 224, 224]               0
             ReLU-17         [-1, 64, 224, 224]               0
             ReLU-18         [-1, 64, 224, 224]               0
             ReLU-19         [-1, 64, 224, 224]               0
             ReLU-20         [-1, 64, 224, 224]               0
             ReLU-21         [-1, 64, 224, 224]               0
           Conv2d-22        [-1, 128, 112, 112]          73,856
      BatchNorm2d-23        [-1, 128, 112, 112]             256
             ReLU-24        [-1, 128, 112, 112]               0
             ReLU-25        [-1, 128, 112, 112]               0
             ReLU-26        [-1, 128, 112, 112]               0
             ReLU-27        [-1, 128, 112, 112]               0
             ReLU-28        [-1, 128, 112, 112]               0
             ReLU-29        [-1, 128, 112, 112]               0
             ReLU-30        [-1, 128, 112, 112]               0
             ReLU-31        [-1, 128, 112, 112]               0
             ReLU-32        [-1, 128, 112, 112]               0
             ReLU-33        [-1, 128, 112, 112]               0
             ReLU-34        [-1, 128, 112, 112]               0
             ReLU-35        [-1, 128, 112, 112]               0
             ReLU-36        [-1, 128, 112, 112]               0
             ReLU-37        [-1, 128, 112, 112]               0
             ReLU-38        [-1, 128, 112, 112]               0
             ReLU-39        [-1, 128, 112, 112]               0
             ReLU-40        [-1, 128, 112, 112]               0
             ReLU-41        [-1, 128, 112, 112]               0
           Conv2d-42          [-1, 256, 56, 56]         295,168
      BatchNorm2d-43          [-1, 256, 56, 56]             512
             ReLU-44          [-1, 256, 56, 56]               0
             ReLU-45          [-1, 256, 56, 56]               0
             ReLU-46          [-1, 256, 56, 56]               0
             ReLU-47          [-1, 256, 56, 56]               0
             ReLU-48          [-1, 256, 56, 56]               0
             ReLU-49          [-1, 256, 56, 56]               0
             ReLU-50          [-1, 256, 56, 56]               0
             ReLU-51          [-1, 256, 56, 56]               0
             ReLU-52          [-1, 256, 56, 56]               0
             ReLU-53          [-1, 256, 56, 56]               0
             ReLU-54          [-1, 256, 56, 56]               0
             ReLU-55          [-1, 256, 56, 56]               0
             ReLU-56          [-1, 256, 56, 56]               0
             ReLU-57          [-1, 256, 56, 56]               0
             ReLU-58          [-1, 256, 56, 56]               0
             ReLU-59          [-1, 256, 56, 56]               0
             ReLU-60          [-1, 256, 56, 56]               0
             ReLU-61          [-1, 256, 56, 56]               0
           Conv2d-62          [-1, 512, 28, 28]       1,180,160
      BatchNorm2d-63          [-1, 512, 28, 28]           1,024
             ReLU-64          [-1, 512, 28, 28]               0
             ReLU-65          [-1, 512, 28, 28]               0
             ReLU-66          [-1, 512, 28, 28]               0
             ReLU-67          [-1, 512, 28, 28]               0
             ReLU-68          [-1, 512, 28, 28]               0
             ReLU-69          [-1, 512, 28, 28]               0
             ReLU-70          [-1, 512, 28, 28]               0
             ReLU-71          [-1, 512, 28, 28]               0
             ReLU-72          [-1, 512, 28, 28]               0
             ReLU-73          [-1, 512, 28, 28]               0
             ReLU-74          [-1, 512, 28, 28]               0
             ReLU-75          [-1, 512, 28, 28]               0
             ReLU-76          [-1, 512, 28, 28]               0
             ReLU-77          [-1, 512, 28, 28]               0
             ReLU-78          [-1, 512, 28, 28]               0
             ReLU-79          [-1, 512, 28, 28]               0
             ReLU-80          [-1, 512, 28, 28]               0
             ReLU-81          [-1, 512, 28, 28]               0
           Conv2d-82          [-1, 512, 14, 14]       2,359,808
      BatchNorm2d-83          [-1, 512, 14, 14]           1,024
             ReLU-84          [-1, 512, 14, 14]               0
             ReLU-85          [-1, 512, 14, 14]               0
             ReLU-86          [-1, 512, 14, 14]               0
             ReLU-87          [-1, 512, 14, 14]               0
             ReLU-88          [-1, 512, 14, 14]               0
             ReLU-89          [-1, 512, 14, 14]               0
             ReLU-90          [-1, 512, 14, 14]               0
             ReLU-91          [-1, 512, 14, 14]               0
             ReLU-92          [-1, 512, 14, 14]               0
             ReLU-93          [-1, 512, 14, 14]               0
             ReLU-94          [-1, 512, 14, 14]               0
             ReLU-95          [-1, 512, 14, 14]               0
             ReLU-96          [-1, 512, 14, 14]               0
             ReLU-97          [-1, 512, 14, 14]               0
             ReLU-98          [-1, 512, 14, 14]               0
             ReLU-99          [-1, 512, 14, 14]               0
            ReLU-100          [-1, 512, 14, 14]               0
            ReLU-101          [-1, 512, 14, 14]               0
 ReflectionPad2d-102          [-1, 512, 16, 16]               0
          Conv2d-103          [-1, 512, 14, 14]       2,359,808
    InstanceNorm-104          [-1, 512, 14, 14]               0
          Linear-105                 [-1, 1024]         525,312
      ApplyStyle-106          [-1, 512, 14, 14]               0
            ReLU-107          [-1, 512, 14, 14]               0
            ReLU-108          [-1, 512, 14, 14]               0
            ReLU-109          [-1, 512, 14, 14]               0
            ReLU-110          [-1, 512, 14, 14]               0
            ReLU-111          [-1, 512, 14, 14]               0
            ReLU-112          [-1, 512, 14, 14]               0
            ReLU-113          [-1, 512, 14, 14]               0
            ReLU-114          [-1, 512, 14, 14]               0
            ReLU-115          [-1, 512, 14, 14]               0
            ReLU-116          [-1, 512, 14, 14]               0
            ReLU-117          [-1, 512, 14, 14]               0
            ReLU-118          [-1, 512, 14, 14]               0
            ReLU-119          [-1, 512, 14, 14]               0
            ReLU-120          [-1, 512, 14, 14]               0
            ReLU-121          [-1, 512, 14, 14]               0
            ReLU-122          [-1, 512, 14, 14]               0
            ReLU-123          [-1, 512, 14, 14]               0
            ReLU-124          [-1, 512, 14, 14]               0
 ReflectionPad2d-125          [-1, 512, 16, 16]               0
          Conv2d-126          [-1, 512, 14, 14]       2,359,808
    InstanceNorm-127          [-1, 512, 14, 14]               0
          Linear-128                 [-1, 1024]         525,312
      ApplyStyle-129          [-1, 512, 14, 14]               0
ResnetBlock_Adain-130          [-1, 512, 14, 14]               0
 ReflectionPad2d-131          [-1, 512, 16, 16]               0
          Conv2d-132          [-1, 512, 14, 14]       2,359,808
    InstanceNorm-133          [-1, 512, 14, 14]               0
          Linear-134                 [-1, 1024]         525,312
      ApplyStyle-135          [-1, 512, 14, 14]               0
            ReLU-136          [-1, 512, 14, 14]               0
            ReLU-137          [-1, 512, 14, 14]               0
            ReLU-138          [-1, 512, 14, 14]               0
            ReLU-139          [-1, 512, 14, 14]               0
            ReLU-140          [-1, 512, 14, 14]               0
            ReLU-141          [-1, 512, 14, 14]               0
            ReLU-142          [-1, 512, 14, 14]               0
            ReLU-143          [-1, 512, 14, 14]               0
            ReLU-144          [-1, 512, 14, 14]               0
            ReLU-145          [-1, 512, 14, 14]               0
            ReLU-146          [-1, 512, 14, 14]               0
            ReLU-147          [-1, 512, 14, 14]               0
            ReLU-148          [-1, 512, 14, 14]               0
            ReLU-149          [-1, 512, 14, 14]               0
            ReLU-150          [-1, 512, 14, 14]               0
            ReLU-151          [-1, 512, 14, 14]               0
            ReLU-152          [-1, 512, 14, 14]               0
            ReLU-153          [-1, 512, 14, 14]               0
 ReflectionPad2d-154          [-1, 512, 16, 16]               0
          Conv2d-155          [-1, 512, 14, 14]       2,359,808
    InstanceNorm-156          [-1, 512, 14, 14]               0
          Linear-157                 [-1, 1024]         525,312
      ApplyStyle-158          [-1, 512, 14, 14]               0
ResnetBlock_Adain-159          [-1, 512, 14, 14]               0
 ReflectionPad2d-160          [-1, 512, 16, 16]               0
          Conv2d-161          [-1, 512, 14, 14]       2,359,808
    InstanceNorm-162          [-1, 512, 14, 14]               0
          Linear-163                 [-1, 1024]         525,312
      ApplyStyle-164          [-1, 512, 14, 14]               0
            ReLU-165          [-1, 512, 14, 14]               0
            ReLU-166          [-1, 512, 14, 14]               0
            ReLU-167          [-1, 512, 14, 14]               0
            ReLU-168          [-1, 512, 14, 14]               0
            ReLU-169          [-1, 512, 14, 14]               0
            ReLU-170          [-1, 512, 14, 14]               0
            ReLU-171          [-1, 512, 14, 14]               0
            ReLU-172          [-1, 512, 14, 14]               0
            ReLU-173          [-1, 512, 14, 14]               0
            ReLU-174          [-1, 512, 14, 14]               0
            ReLU-175          [-1, 512, 14, 14]               0
            ReLU-176          [-1, 512, 14, 14]               0
            ReLU-177          [-1, 512, 14, 14]               0
            ReLU-178          [-1, 512, 14, 14]               0
            ReLU-179          [-1, 512, 14, 14]               0
            ReLU-180          [-1, 512, 14, 14]               0
            ReLU-181          [-1, 512, 14, 14]               0
            ReLU-182          [-1, 512, 14, 14]               0
 ReflectionPad2d-183          [-1, 512, 16, 16]               0
          Conv2d-184          [-1, 512, 14, 14]       2,359,808
    InstanceNorm-185          [-1, 512, 14, 14]               0
          Linear-186                 [-1, 1024]         525,312
      ApplyStyle-187          [-1, 512, 14, 14]               0
ResnetBlock_Adain-188          [-1, 512, 14, 14]               0
 ReflectionPad2d-189          [-1, 512, 16, 16]               0
          Conv2d-190          [-1, 512, 14, 14]       2,359,808
    InstanceNorm-191          [-1, 512, 14, 14]               0
          Linear-192                 [-1, 1024]         525,312
      ApplyStyle-193          [-1, 512, 14, 14]               0
            ReLU-194          [-1, 512, 14, 14]               0
            ReLU-195          [-1, 512, 14, 14]               0
            ReLU-196          [-1, 512, 14, 14]               0
            ReLU-197          [-1, 512, 14, 14]               0
            ReLU-198          [-1, 512, 14, 14]               0
            ReLU-199          [-1, 512, 14, 14]               0
            ReLU-200          [-1, 512, 14, 14]               0
            ReLU-201          [-1, 512, 14, 14]               0
            ReLU-202          [-1, 512, 14, 14]               0
            ReLU-203          [-1, 512, 14, 14]               0
            ReLU-204          [-1, 512, 14, 14]               0
            ReLU-205          [-1, 512, 14, 14]               0
            ReLU-206          [-1, 512, 14, 14]               0
            ReLU-207          [-1, 512, 14, 14]               0
            ReLU-208          [-1, 512, 14, 14]               0
            ReLU-209          [-1, 512, 14, 14]               0
            ReLU-210          [-1, 512, 14, 14]               0
            ReLU-211          [-1, 512, 14, 14]               0
 ReflectionPad2d-212          [-1, 512, 16, 16]               0
          Conv2d-213          [-1, 512, 14, 14]       2,359,808
    InstanceNorm-214          [-1, 512, 14, 14]               0
          Linear-215                 [-1, 1024]         525,312
      ApplyStyle-216          [-1, 512, 14, 14]               0
ResnetBlock_Adain-217          [-1, 512, 14, 14]               0
 ReflectionPad2d-218          [-1, 512, 16, 16]               0
          Conv2d-219          [-1, 512, 14, 14]       2,359,808
    InstanceNorm-220          [-1, 512, 14, 14]               0
          Linear-221                 [-1, 1024]         525,312
      ApplyStyle-222          [-1, 512, 14, 14]               0
            ReLU-223          [-1, 512, 14, 14]               0
            ReLU-224          [-1, 512, 14, 14]               0
            ReLU-225          [-1, 512, 14, 14]               0
            ReLU-226          [-1, 512, 14, 14]               0
            ReLU-227          [-1, 512, 14, 14]               0
            ReLU-228          [-1, 512, 14, 14]               0
            ReLU-229          [-1, 512, 14, 14]               0
            ReLU-230          [-1, 512, 14, 14]               0
            ReLU-231          [-1, 512, 14, 14]               0
            ReLU-232          [-1, 512, 14, 14]               0
            ReLU-233          [-1, 512, 14, 14]               0
            ReLU-234          [-1, 512, 14, 14]               0
            ReLU-235          [-1, 512, 14, 14]               0
            ReLU-236          [-1, 512, 14, 14]               0
            ReLU-237          [-1, 512, 14, 14]               0
            ReLU-238          [-1, 512, 14, 14]               0
            ReLU-239          [-1, 512, 14, 14]               0
            ReLU-240          [-1, 512, 14, 14]               0
 ReflectionPad2d-241          [-1, 512, 16, 16]               0
          Conv2d-242          [-1, 512, 14, 14]       2,359,808
    InstanceNorm-243          [-1, 512, 14, 14]               0
          Linear-244                 [-1, 1024]         525,312
      ApplyStyle-245          [-1, 512, 14, 14]               0
ResnetBlock_Adain-246          [-1, 512, 14, 14]               0
 ReflectionPad2d-247          [-1, 512, 16, 16]               0
          Conv2d-248          [-1, 512, 14, 14]       2,359,808
    InstanceNorm-249          [-1, 512, 14, 14]               0
          Linear-250                 [-1, 1024]         525,312
      ApplyStyle-251          [-1, 512, 14, 14]               0
            ReLU-252          [-1, 512, 14, 14]               0
            ReLU-253          [-1, 512, 14, 14]               0
            ReLU-254          [-1, 512, 14, 14]               0
            ReLU-255          [-1, 512, 14, 14]               0
            ReLU-256          [-1, 512, 14, 14]               0
            ReLU-257          [-1, 512, 14, 14]               0
            ReLU-258          [-1, 512, 14, 14]               0
            ReLU-259          [-1, 512, 14, 14]               0
            ReLU-260          [-1, 512, 14, 14]               0
            ReLU-261          [-1, 512, 14, 14]               0
            ReLU-262          [-1, 512, 14, 14]               0
            ReLU-263          [-1, 512, 14, 14]               0
            ReLU-264          [-1, 512, 14, 14]               0
            ReLU-265          [-1, 512, 14, 14]               0
            ReLU-266          [-1, 512, 14, 14]               0
            ReLU-267          [-1, 512, 14, 14]               0
            ReLU-268          [-1, 512, 14, 14]               0
            ReLU-269          [-1, 512, 14, 14]               0
 ReflectionPad2d-270          [-1, 512, 16, 16]               0
          Conv2d-271          [-1, 512, 14, 14]       2,359,808
    InstanceNorm-272          [-1, 512, 14, 14]               0
          Linear-273                 [-1, 1024]         525,312
      ApplyStyle-274          [-1, 512, 14, 14]               0
ResnetBlock_Adain-275          [-1, 512, 14, 14]               0
 ReflectionPad2d-276          [-1, 512, 16, 16]               0
          Conv2d-277          [-1, 512, 14, 14]       2,359,808
    InstanceNorm-278          [-1, 512, 14, 14]               0
          Linear-279                 [-1, 1024]         525,312
      ApplyStyle-280          [-1, 512, 14, 14]               0
            ReLU-281          [-1, 512, 14, 14]               0
            ReLU-282          [-1, 512, 14, 14]               0
            ReLU-283          [-1, 512, 14, 14]               0
            ReLU-284          [-1, 512, 14, 14]               0
            ReLU-285          [-1, 512, 14, 14]               0
            ReLU-286          [-1, 512, 14, 14]               0
            ReLU-287          [-1, 512, 14, 14]               0
            ReLU-288          [-1, 512, 14, 14]               0
            ReLU-289          [-1, 512, 14, 14]               0
            ReLU-290          [-1, 512, 14, 14]               0
            ReLU-291          [-1, 512, 14, 14]               0
            ReLU-292          [-1, 512, 14, 14]               0
            ReLU-293          [-1, 512, 14, 14]               0
            ReLU-294          [-1, 512, 14, 14]               0
            ReLU-295          [-1, 512, 14, 14]               0
            ReLU-296          [-1, 512, 14, 14]               0
            ReLU-297          [-1, 512, 14, 14]               0
            ReLU-298          [-1, 512, 14, 14]               0
 ReflectionPad2d-299          [-1, 512, 16, 16]               0
          Conv2d-300          [-1, 512, 14, 14]       2,359,808
    InstanceNorm-301          [-1, 512, 14, 14]               0
          Linear-302                 [-1, 1024]         525,312
      ApplyStyle-303          [-1, 512, 14, 14]               0
ResnetBlock_Adain-304          [-1, 512, 14, 14]               0
 ReflectionPad2d-305          [-1, 512, 16, 16]               0
          Conv2d-306          [-1, 512, 14, 14]       2,359,808
    InstanceNorm-307          [-1, 512, 14, 14]               0
          Linear-308                 [-1, 1024]         525,312
      ApplyStyle-309          [-1, 512, 14, 14]               0
            ReLU-310          [-1, 512, 14, 14]               0
            ReLU-311          [-1, 512, 14, 14]               0
            ReLU-312          [-1, 512, 14, 14]               0
            ReLU-313          [-1, 512, 14, 14]               0
            ReLU-314          [-1, 512, 14, 14]               0
            ReLU-315          [-1, 512, 14, 14]               0
            ReLU-316          [-1, 512, 14, 14]               0
            ReLU-317          [-1, 512, 14, 14]               0
            ReLU-318          [-1, 512, 14, 14]               0
            ReLU-319          [-1, 512, 14, 14]               0
            ReLU-320          [-1, 512, 14, 14]               0
            ReLU-321          [-1, 512, 14, 14]               0
            ReLU-322          [-1, 512, 14, 14]               0
            ReLU-323          [-1, 512, 14, 14]               0
            ReLU-324          [-1, 512, 14, 14]               0
            ReLU-325          [-1, 512, 14, 14]               0
            ReLU-326          [-1, 512, 14, 14]               0
            ReLU-327          [-1, 512, 14, 14]               0
 ReflectionPad2d-328          [-1, 512, 16, 16]               0
          Conv2d-329          [-1, 512, 14, 14]       2,359,808
    InstanceNorm-330          [-1, 512, 14, 14]               0
          Linear-331                 [-1, 1024]         525,312
      ApplyStyle-332          [-1, 512, 14, 14]               0
ResnetBlock_Adain-333          [-1, 512, 14, 14]               0
 ReflectionPad2d-334          [-1, 512, 16, 16]               0
          Conv2d-335          [-1, 512, 14, 14]       2,359,808
    InstanceNorm-336          [-1, 512, 14, 14]               0
          Linear-337                 [-1, 1024]         525,312
      ApplyStyle-338          [-1, 512, 14, 14]               0
            ReLU-339          [-1, 512, 14, 14]               0
            ReLU-340          [-1, 512, 14, 14]               0
            ReLU-341          [-1, 512, 14, 14]               0
            ReLU-342          [-1, 512, 14, 14]               0
            ReLU-343          [-1, 512, 14, 14]               0
            ReLU-344          [-1, 512, 14, 14]               0
            ReLU-345          [-1, 512, 14, 14]               0
            ReLU-346          [-1, 512, 14, 14]               0
            ReLU-347          [-1, 512, 14, 14]               0
            ReLU-348          [-1, 512, 14, 14]               0
            ReLU-349          [-1, 512, 14, 14]               0
            ReLU-350          [-1, 512, 14, 14]               0
            ReLU-351          [-1, 512, 14, 14]               0
            ReLU-352          [-1, 512, 14, 14]               0
            ReLU-353          [-1, 512, 14, 14]               0
            ReLU-354          [-1, 512, 14, 14]               0
            ReLU-355          [-1, 512, 14, 14]               0
            ReLU-356          [-1, 512, 14, 14]               0
 ReflectionPad2d-357          [-1, 512, 16, 16]               0
          Conv2d-358          [-1, 512, 14, 14]       2,359,808
    InstanceNorm-359          [-1, 512, 14, 14]               0
          Linear-360                 [-1, 1024]         525,312
      ApplyStyle-361          [-1, 512, 14, 14]               0
ResnetBlock_Adain-362          [-1, 512, 14, 14]               0
        Upsample-363          [-1, 512, 28, 28]               0
          Conv2d-364          [-1, 512, 28, 28]       2,359,808
     BatchNorm2d-365          [-1, 512, 28, 28]           1,024
            ReLU-366          [-1, 512, 28, 28]               0
            ReLU-367          [-1, 512, 28, 28]               0
            ReLU-368          [-1, 512, 28, 28]               0
            ReLU-369          [-1, 512, 28, 28]               0
            ReLU-370          [-1, 512, 28, 28]               0
            ReLU-371          [-1, 512, 28, 28]               0
            ReLU-372          [-1, 512, 28, 28]               0
            ReLU-373          [-1, 512, 28, 28]               0
            ReLU-374          [-1, 512, 28, 28]               0
            ReLU-375          [-1, 512, 28, 28]               0
            ReLU-376          [-1, 512, 28, 28]               0
            ReLU-377          [-1, 512, 28, 28]               0
            ReLU-378          [-1, 512, 28, 28]               0
            ReLU-379          [-1, 512, 28, 28]               0
            ReLU-380          [-1, 512, 28, 28]               0
            ReLU-381          [-1, 512, 28, 28]               0
            ReLU-382          [-1, 512, 28, 28]               0
            ReLU-383          [-1, 512, 28, 28]               0
        Upsample-384          [-1, 512, 56, 56]               0
          Conv2d-385          [-1, 256, 56, 56]       1,179,904
     BatchNorm2d-386          [-1, 256, 56, 56]             512
            ReLU-387          [-1, 256, 56, 56]               0
            ReLU-388          [-1, 256, 56, 56]               0
            ReLU-389          [-1, 256, 56, 56]               0
            ReLU-390          [-1, 256, 56, 56]               0
            ReLU-391          [-1, 256, 56, 56]               0
            ReLU-392          [-1, 256, 56, 56]               0
            ReLU-393          [-1, 256, 56, 56]               0
            ReLU-394          [-1, 256, 56, 56]               0
            ReLU-395          [-1, 256, 56, 56]               0
            ReLU-396          [-1, 256, 56, 56]               0
            ReLU-397          [-1, 256, 56, 56]               0
            ReLU-398          [-1, 256, 56, 56]               0
            ReLU-399          [-1, 256, 56, 56]               0
            ReLU-400          [-1, 256, 56, 56]               0
            ReLU-401          [-1, 256, 56, 56]               0
            ReLU-402          [-1, 256, 56, 56]               0
            ReLU-403          [-1, 256, 56, 56]               0
            ReLU-404          [-1, 256, 56, 56]               0
        Upsample-405        [-1, 256, 112, 112]               0
          Conv2d-406        [-1, 128, 112, 112]         295,040
     BatchNorm2d-407        [-1, 128, 112, 112]             256
            ReLU-408        [-1, 128, 112, 112]               0
            ReLU-409        [-1, 128, 112, 112]               0
            ReLU-410        [-1, 128, 112, 112]               0
            ReLU-411        [-1, 128, 112, 112]               0
            ReLU-412        [-1, 128, 112, 112]               0
            ReLU-413        [-1, 128, 112, 112]               0
            ReLU-414        [-1, 128, 112, 112]               0
            ReLU-415        [-1, 128, 112, 112]               0
            ReLU-416        [-1, 128, 112, 112]               0
            ReLU-417        [-1, 128, 112, 112]               0
            ReLU-418        [-1, 128, 112, 112]               0
            ReLU-419        [-1, 128, 112, 112]               0
            ReLU-420        [-1, 128, 112, 112]               0
            ReLU-421        [-1, 128, 112, 112]               0
            ReLU-422        [-1, 128, 112, 112]               0
            ReLU-423        [-1, 128, 112, 112]               0
            ReLU-424        [-1, 128, 112, 112]               0
            ReLU-425        [-1, 128, 112, 112]               0
        Upsample-426        [-1, 128, 224, 224]               0
          Conv2d-427         [-1, 64, 224, 224]          73,792
     BatchNorm2d-428         [-1, 64, 224, 224]             128
            ReLU-429         [-1, 64, 224, 224]               0
            ReLU-430         [-1, 64, 224, 224]               0
            ReLU-431         [-1, 64, 224, 224]               0
            ReLU-432         [-1, 64, 224, 224]               0
            ReLU-433         [-1, 64, 224, 224]               0
            ReLU-434         [-1, 64, 224, 224]               0
            ReLU-435         [-1, 64, 224, 224]               0
            ReLU-436         [-1, 64, 224, 224]               0
            ReLU-437         [-1, 64, 224, 224]               0
            ReLU-438         [-1, 64, 224, 224]               0
            ReLU-439         [-1, 64, 224, 224]               0
            ReLU-440         [-1, 64, 224, 224]               0
            ReLU-441         [-1, 64, 224, 224]               0
            ReLU-442         [-1, 64, 224, 224]               0
            ReLU-443         [-1, 64, 224, 224]               0
            ReLU-444         [-1, 64, 224, 224]               0
            ReLU-445         [-1, 64, 224, 224]               0
            ReLU-446         [-1, 64, 224, 224]               0
 ReflectionPad2d-447         [-1, 64, 230, 230]               0
          Conv2d-448          [-1, 3, 224, 224]           9,411
================================================================
Total params: 59,773,443
Trainable params: 59,773,443
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 2160.22
Params size (MB): 228.02
Estimated Total Size (MB): 2388.81
----------------------------------------------------------------
