----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
   ReflectionPad2d-1          [-1, 3, 230, 230]               0
            Conv2d-2         [-1, 64, 224, 224]           9,472
       BatchNorm2d-3         [-1, 64, 224, 224]             128
              ReLU-4         [-1, 64, 224, 224]               0
              ReLU-5         [-1, 64, 224, 224]               0
              ReLU-6         [-1, 64, 224, 224]               0
              ReLU-7         [-1, 64, 224, 224]               0
              ReLU-8         [-1, 64, 224, 224]               0
              ReLU-9         [-1, 64, 224, 224]               0
             ReLU-10         [-1, 64, 224, 224]               0
             ReLU-11         [-1, 64, 224, 224]               0
             ReLU-12         [-1, 64, 224, 224]               0
             ReLU-13         [-1, 64, 224, 224]               0
             ReLU-14         [-1, 64, 224, 224]               0
             ReLU-15         [-1, 64, 224, 224]               0
             ReLU-16         [-1, 64, 224, 224]               0
             ReLU-17         [-1, 64, 224, 224]               0
             ReLU-18         [-1, 64, 224, 224]               0
             ReLU-19         [-1, 64, 224, 224]               0
           Conv2d-20        [-1, 128, 112, 112]          73,856
      BatchNorm2d-21        [-1, 128, 112, 112]             256
             ReLU-22        [-1, 128, 112, 112]               0
             ReLU-23        [-1, 128, 112, 112]               0
             ReLU-24        [-1, 128, 112, 112]               0
             ReLU-25        [-1, 128, 112, 112]               0
             ReLU-26        [-1, 128, 112, 112]               0
             ReLU-27        [-1, 128, 112, 112]               0
             ReLU-28        [-1, 128, 112, 112]               0
             ReLU-29        [-1, 128, 112, 112]               0
             ReLU-30        [-1, 128, 112, 112]               0
             ReLU-31        [-1, 128, 112, 112]               0
             ReLU-32        [-1, 128, 112, 112]               0
             ReLU-33        [-1, 128, 112, 112]               0
             ReLU-34        [-1, 128, 112, 112]               0
             ReLU-35        [-1, 128, 112, 112]               0
             ReLU-36        [-1, 128, 112, 112]               0
             ReLU-37        [-1, 128, 112, 112]               0
           Conv2d-38          [-1, 256, 56, 56]         295,168
      BatchNorm2d-39          [-1, 256, 56, 56]             512
             ReLU-40          [-1, 256, 56, 56]               0
             ReLU-41          [-1, 256, 56, 56]               0
             ReLU-42          [-1, 256, 56, 56]               0
             ReLU-43          [-1, 256, 56, 56]               0
             ReLU-44          [-1, 256, 56, 56]               0
             ReLU-45          [-1, 256, 56, 56]               0
             ReLU-46          [-1, 256, 56, 56]               0
             ReLU-47          [-1, 256, 56, 56]               0
             ReLU-48          [-1, 256, 56, 56]               0
             ReLU-49          [-1, 256, 56, 56]               0
             ReLU-50          [-1, 256, 56, 56]               0
             ReLU-51          [-1, 256, 56, 56]               0
             ReLU-52          [-1, 256, 56, 56]               0
             ReLU-53          [-1, 256, 56, 56]               0
             ReLU-54          [-1, 256, 56, 56]               0
             ReLU-55          [-1, 256, 56, 56]               0
           Conv2d-56          [-1, 512, 28, 28]       1,180,160
      BatchNorm2d-57          [-1, 512, 28, 28]           1,024
             ReLU-58          [-1, 512, 28, 28]               0
             ReLU-59          [-1, 512, 28, 28]               0
             ReLU-60          [-1, 512, 28, 28]               0
             ReLU-61          [-1, 512, 28, 28]               0
             ReLU-62          [-1, 512, 28, 28]               0
             ReLU-63          [-1, 512, 28, 28]               0
             ReLU-64          [-1, 512, 28, 28]               0
             ReLU-65          [-1, 512, 28, 28]               0
             ReLU-66          [-1, 512, 28, 28]               0
             ReLU-67          [-1, 512, 28, 28]               0
             ReLU-68          [-1, 512, 28, 28]               0
             ReLU-69          [-1, 512, 28, 28]               0
             ReLU-70          [-1, 512, 28, 28]               0
             ReLU-71          [-1, 512, 28, 28]               0
             ReLU-72          [-1, 512, 28, 28]               0
             ReLU-73          [-1, 512, 28, 28]               0
  ReflectionPad2d-74          [-1, 512, 30, 30]               0
           Conv2d-75          [-1, 512, 28, 28]       2,359,808
     InstanceNorm-76          [-1, 512, 28, 28]               0
           Linear-77                 [-1, 1024]         525,312
       ApplyStyle-78          [-1, 512, 28, 28]               0
             ReLU-79          [-1, 512, 28, 28]               0
             ReLU-80          [-1, 512, 28, 28]               0
             ReLU-81          [-1, 512, 28, 28]               0
             ReLU-82          [-1, 512, 28, 28]               0
             ReLU-83          [-1, 512, 28, 28]               0
             ReLU-84          [-1, 512, 28, 28]               0
             ReLU-85          [-1, 512, 28, 28]               0
             ReLU-86          [-1, 512, 28, 28]               0
             ReLU-87          [-1, 512, 28, 28]               0
             ReLU-88          [-1, 512, 28, 28]               0
             ReLU-89          [-1, 512, 28, 28]               0
             ReLU-90          [-1, 512, 28, 28]               0
             ReLU-91          [-1, 512, 28, 28]               0
             ReLU-92          [-1, 512, 28, 28]               0
             ReLU-93          [-1, 512, 28, 28]               0
             ReLU-94          [-1, 512, 28, 28]               0
  ReflectionPad2d-95          [-1, 512, 30, 30]               0
           Conv2d-96          [-1, 512, 28, 28]       2,359,808
     InstanceNorm-97          [-1, 512, 28, 28]               0
           Linear-98                 [-1, 1024]         525,312
       ApplyStyle-99          [-1, 512, 28, 28]               0
ResnetBlock_Adain-100          [-1, 512, 28, 28]               0
 ReflectionPad2d-101          [-1, 512, 30, 30]               0
          Conv2d-102          [-1, 512, 28, 28]       2,359,808
    InstanceNorm-103          [-1, 512, 28, 28]               0
          Linear-104                 [-1, 1024]         525,312
      ApplyStyle-105          [-1, 512, 28, 28]               0
            ReLU-106          [-1, 512, 28, 28]               0
            ReLU-107          [-1, 512, 28, 28]               0
            ReLU-108          [-1, 512, 28, 28]               0
            ReLU-109          [-1, 512, 28, 28]               0
            ReLU-110          [-1, 512, 28, 28]               0
            ReLU-111          [-1, 512, 28, 28]               0
            ReLU-112          [-1, 512, 28, 28]               0
            ReLU-113          [-1, 512, 28, 28]               0
            ReLU-114          [-1, 512, 28, 28]               0
            ReLU-115          [-1, 512, 28, 28]               0
            ReLU-116          [-1, 512, 28, 28]               0
            ReLU-117          [-1, 512, 28, 28]               0
            ReLU-118          [-1, 512, 28, 28]               0
            ReLU-119          [-1, 512, 28, 28]               0
            ReLU-120          [-1, 512, 28, 28]               0
            ReLU-121          [-1, 512, 28, 28]               0
 ReflectionPad2d-122          [-1, 512, 30, 30]               0
          Conv2d-123          [-1, 512, 28, 28]       2,359,808
    InstanceNorm-124          [-1, 512, 28, 28]               0
          Linear-125                 [-1, 1024]         525,312
      ApplyStyle-126          [-1, 512, 28, 28]               0
ResnetBlock_Adain-127          [-1, 512, 28, 28]               0
 ReflectionPad2d-128          [-1, 512, 30, 30]               0
          Conv2d-129          [-1, 512, 28, 28]       2,359,808
    InstanceNorm-130          [-1, 512, 28, 28]               0
          Linear-131                 [-1, 1024]         525,312
      ApplyStyle-132          [-1, 512, 28, 28]               0
            ReLU-133          [-1, 512, 28, 28]               0
            ReLU-134          [-1, 512, 28, 28]               0
            ReLU-135          [-1, 512, 28, 28]               0
            ReLU-136          [-1, 512, 28, 28]               0
            ReLU-137          [-1, 512, 28, 28]               0
            ReLU-138          [-1, 512, 28, 28]               0
            ReLU-139          [-1, 512, 28, 28]               0
            ReLU-140          [-1, 512, 28, 28]               0
            ReLU-141          [-1, 512, 28, 28]               0
            ReLU-142          [-1, 512, 28, 28]               0
            ReLU-143          [-1, 512, 28, 28]               0
            ReLU-144          [-1, 512, 28, 28]               0
            ReLU-145          [-1, 512, 28, 28]               0
            ReLU-146          [-1, 512, 28, 28]               0
            ReLU-147          [-1, 512, 28, 28]               0
            ReLU-148          [-1, 512, 28, 28]               0
 ReflectionPad2d-149          [-1, 512, 30, 30]               0
          Conv2d-150          [-1, 512, 28, 28]       2,359,808
    InstanceNorm-151          [-1, 512, 28, 28]               0
          Linear-152                 [-1, 1024]         525,312
      ApplyStyle-153          [-1, 512, 28, 28]               0
ResnetBlock_Adain-154          [-1, 512, 28, 28]               0
 ReflectionPad2d-155          [-1, 512, 30, 30]               0
          Conv2d-156          [-1, 512, 28, 28]       2,359,808
    InstanceNorm-157          [-1, 512, 28, 28]               0
          Linear-158                 [-1, 1024]         525,312
      ApplyStyle-159          [-1, 512, 28, 28]               0
            ReLU-160          [-1, 512, 28, 28]               0
            ReLU-161          [-1, 512, 28, 28]               0
            ReLU-162          [-1, 512, 28, 28]               0
            ReLU-163          [-1, 512, 28, 28]               0
            ReLU-164          [-1, 512, 28, 28]               0
            ReLU-165          [-1, 512, 28, 28]               0
            ReLU-166          [-1, 512, 28, 28]               0
            ReLU-167          [-1, 512, 28, 28]               0
            ReLU-168          [-1, 512, 28, 28]               0
            ReLU-169          [-1, 512, 28, 28]               0
            ReLU-170          [-1, 512, 28, 28]               0
            ReLU-171          [-1, 512, 28, 28]               0
            ReLU-172          [-1, 512, 28, 28]               0
            ReLU-173          [-1, 512, 28, 28]               0
            ReLU-174          [-1, 512, 28, 28]               0
            ReLU-175          [-1, 512, 28, 28]               0
 ReflectionPad2d-176          [-1, 512, 30, 30]               0
          Conv2d-177          [-1, 512, 28, 28]       2,359,808
    InstanceNorm-178          [-1, 512, 28, 28]               0
          Linear-179                 [-1, 1024]         525,312
      ApplyStyle-180          [-1, 512, 28, 28]               0
ResnetBlock_Adain-181          [-1, 512, 28, 28]               0
 ReflectionPad2d-182          [-1, 512, 30, 30]               0
          Conv2d-183          [-1, 512, 28, 28]       2,359,808
    InstanceNorm-184          [-1, 512, 28, 28]               0
          Linear-185                 [-1, 1024]         525,312
      ApplyStyle-186          [-1, 512, 28, 28]               0
            ReLU-187          [-1, 512, 28, 28]               0
            ReLU-188          [-1, 512, 28, 28]               0
            ReLU-189          [-1, 512, 28, 28]               0
            ReLU-190          [-1, 512, 28, 28]               0
            ReLU-191          [-1, 512, 28, 28]               0
            ReLU-192          [-1, 512, 28, 28]               0
            ReLU-193          [-1, 512, 28, 28]               0
            ReLU-194          [-1, 512, 28, 28]               0
            ReLU-195          [-1, 512, 28, 28]               0
            ReLU-196          [-1, 512, 28, 28]               0
            ReLU-197          [-1, 512, 28, 28]               0
            ReLU-198          [-1, 512, 28, 28]               0
            ReLU-199          [-1, 512, 28, 28]               0
            ReLU-200          [-1, 512, 28, 28]               0
            ReLU-201          [-1, 512, 28, 28]               0
            ReLU-202          [-1, 512, 28, 28]               0
 ReflectionPad2d-203          [-1, 512, 30, 30]               0
          Conv2d-204          [-1, 512, 28, 28]       2,359,808
    InstanceNorm-205          [-1, 512, 28, 28]               0
          Linear-206                 [-1, 1024]         525,312
      ApplyStyle-207          [-1, 512, 28, 28]               0
ResnetBlock_Adain-208          [-1, 512, 28, 28]               0
 ReflectionPad2d-209          [-1, 512, 30, 30]               0
          Conv2d-210          [-1, 512, 28, 28]       2,359,808
    InstanceNorm-211          [-1, 512, 28, 28]               0
          Linear-212                 [-1, 1024]         525,312
      ApplyStyle-213          [-1, 512, 28, 28]               0
            ReLU-214          [-1, 512, 28, 28]               0
            ReLU-215          [-1, 512, 28, 28]               0
            ReLU-216          [-1, 512, 28, 28]               0
            ReLU-217          [-1, 512, 28, 28]               0
            ReLU-218          [-1, 512, 28, 28]               0
            ReLU-219          [-1, 512, 28, 28]               0
            ReLU-220          [-1, 512, 28, 28]               0
            ReLU-221          [-1, 512, 28, 28]               0
            ReLU-222          [-1, 512, 28, 28]               0
            ReLU-223          [-1, 512, 28, 28]               0
            ReLU-224          [-1, 512, 28, 28]               0
            ReLU-225          [-1, 512, 28, 28]               0
            ReLU-226          [-1, 512, 28, 28]               0
            ReLU-227          [-1, 512, 28, 28]               0
            ReLU-228          [-1, 512, 28, 28]               0
            ReLU-229          [-1, 512, 28, 28]               0
 ReflectionPad2d-230          [-1, 512, 30, 30]               0
          Conv2d-231          [-1, 512, 28, 28]       2,359,808
    InstanceNorm-232          [-1, 512, 28, 28]               0
          Linear-233                 [-1, 1024]         525,312
      ApplyStyle-234          [-1, 512, 28, 28]               0
ResnetBlock_Adain-235          [-1, 512, 28, 28]               0
 ReflectionPad2d-236          [-1, 512, 30, 30]               0
          Conv2d-237          [-1, 512, 28, 28]       2,359,808
    InstanceNorm-238          [-1, 512, 28, 28]               0
          Linear-239                 [-1, 1024]         525,312
      ApplyStyle-240          [-1, 512, 28, 28]               0
            ReLU-241          [-1, 512, 28, 28]               0
            ReLU-242          [-1, 512, 28, 28]               0
            ReLU-243          [-1, 512, 28, 28]               0
            ReLU-244          [-1, 512, 28, 28]               0
            ReLU-245          [-1, 512, 28, 28]               0
            ReLU-246          [-1, 512, 28, 28]               0
            ReLU-247          [-1, 512, 28, 28]               0
            ReLU-248          [-1, 512, 28, 28]               0
            ReLU-249          [-1, 512, 28, 28]               0
            ReLU-250          [-1, 512, 28, 28]               0
            ReLU-251          [-1, 512, 28, 28]               0
            ReLU-252          [-1, 512, 28, 28]               0
            ReLU-253          [-1, 512, 28, 28]               0
            ReLU-254          [-1, 512, 28, 28]               0
            ReLU-255          [-1, 512, 28, 28]               0
            ReLU-256          [-1, 512, 28, 28]               0
 ReflectionPad2d-257          [-1, 512, 30, 30]               0
          Conv2d-258          [-1, 512, 28, 28]       2,359,808
    InstanceNorm-259          [-1, 512, 28, 28]               0
          Linear-260                 [-1, 1024]         525,312
      ApplyStyle-261          [-1, 512, 28, 28]               0
ResnetBlock_Adain-262          [-1, 512, 28, 28]               0
 ReflectionPad2d-263          [-1, 512, 30, 30]               0
          Conv2d-264          [-1, 512, 28, 28]       2,359,808
    InstanceNorm-265          [-1, 512, 28, 28]               0
          Linear-266                 [-1, 1024]         525,312
      ApplyStyle-267          [-1, 512, 28, 28]               0
            ReLU-268          [-1, 512, 28, 28]               0
            ReLU-269          [-1, 512, 28, 28]               0
            ReLU-270          [-1, 512, 28, 28]               0
            ReLU-271          [-1, 512, 28, 28]               0
            ReLU-272          [-1, 512, 28, 28]               0
            ReLU-273          [-1, 512, 28, 28]               0
            ReLU-274          [-1, 512, 28, 28]               0
            ReLU-275          [-1, 512, 28, 28]               0
            ReLU-276          [-1, 512, 28, 28]               0
            ReLU-277          [-1, 512, 28, 28]               0
            ReLU-278          [-1, 512, 28, 28]               0
            ReLU-279          [-1, 512, 28, 28]               0
            ReLU-280          [-1, 512, 28, 28]               0
            ReLU-281          [-1, 512, 28, 28]               0
            ReLU-282          [-1, 512, 28, 28]               0
            ReLU-283          [-1, 512, 28, 28]               0
 ReflectionPad2d-284          [-1, 512, 30, 30]               0
          Conv2d-285          [-1, 512, 28, 28]       2,359,808
    InstanceNorm-286          [-1, 512, 28, 28]               0
          Linear-287                 [-1, 1024]         525,312
      ApplyStyle-288          [-1, 512, 28, 28]               0
ResnetBlock_Adain-289          [-1, 512, 28, 28]               0
 ReflectionPad2d-290          [-1, 512, 30, 30]               0
          Conv2d-291          [-1, 512, 28, 28]       2,359,808
    InstanceNorm-292          [-1, 512, 28, 28]               0
          Linear-293                 [-1, 1024]         525,312
      ApplyStyle-294          [-1, 512, 28, 28]               0
            ReLU-295          [-1, 512, 28, 28]               0
            ReLU-296          [-1, 512, 28, 28]               0
            ReLU-297          [-1, 512, 28, 28]               0
            ReLU-298          [-1, 512, 28, 28]               0
            ReLU-299          [-1, 512, 28, 28]               0
            ReLU-300          [-1, 512, 28, 28]               0
            ReLU-301          [-1, 512, 28, 28]               0
            ReLU-302          [-1, 512, 28, 28]               0
            ReLU-303          [-1, 512, 28, 28]               0
            ReLU-304          [-1, 512, 28, 28]               0
            ReLU-305          [-1, 512, 28, 28]               0
            ReLU-306          [-1, 512, 28, 28]               0
            ReLU-307          [-1, 512, 28, 28]               0
            ReLU-308          [-1, 512, 28, 28]               0
            ReLU-309          [-1, 512, 28, 28]               0
            ReLU-310          [-1, 512, 28, 28]               0
 ReflectionPad2d-311          [-1, 512, 30, 30]               0
          Conv2d-312          [-1, 512, 28, 28]       2,359,808
    InstanceNorm-313          [-1, 512, 28, 28]               0
          Linear-314                 [-1, 1024]         525,312
      ApplyStyle-315          [-1, 512, 28, 28]               0
ResnetBlock_Adain-316          [-1, 512, 28, 28]               0
        Upsample-317          [-1, 512, 56, 56]               0
          Conv2d-318          [-1, 256, 56, 56]       1,179,904
     BatchNorm2d-319          [-1, 256, 56, 56]             512
            ReLU-320          [-1, 256, 56, 56]               0
            ReLU-321          [-1, 256, 56, 56]               0
            ReLU-322          [-1, 256, 56, 56]               0
            ReLU-323          [-1, 256, 56, 56]               0
            ReLU-324          [-1, 256, 56, 56]               0
            ReLU-325          [-1, 256, 56, 56]               0
            ReLU-326          [-1, 256, 56, 56]               0
            ReLU-327          [-1, 256, 56, 56]               0
            ReLU-328          [-1, 256, 56, 56]               0
            ReLU-329          [-1, 256, 56, 56]               0
            ReLU-330          [-1, 256, 56, 56]               0
            ReLU-331          [-1, 256, 56, 56]               0
            ReLU-332          [-1, 256, 56, 56]               0
            ReLU-333          [-1, 256, 56, 56]               0
            ReLU-334          [-1, 256, 56, 56]               0
            ReLU-335          [-1, 256, 56, 56]               0
        Upsample-336        [-1, 256, 112, 112]               0
          Conv2d-337        [-1, 128, 112, 112]         295,040
     BatchNorm2d-338        [-1, 128, 112, 112]             256
            ReLU-339        [-1, 128, 112, 112]               0
            ReLU-340        [-1, 128, 112, 112]               0
            ReLU-341        [-1, 128, 112, 112]               0
            ReLU-342        [-1, 128, 112, 112]               0
            ReLU-343        [-1, 128, 112, 112]               0
            ReLU-344        [-1, 128, 112, 112]               0
            ReLU-345        [-1, 128, 112, 112]               0
            ReLU-346        [-1, 128, 112, 112]               0
            ReLU-347        [-1, 128, 112, 112]               0
            ReLU-348        [-1, 128, 112, 112]               0
            ReLU-349        [-1, 128, 112, 112]               0
            ReLU-350        [-1, 128, 112, 112]               0
            ReLU-351        [-1, 128, 112, 112]               0
            ReLU-352        [-1, 128, 112, 112]               0
            ReLU-353        [-1, 128, 112, 112]               0
            ReLU-354        [-1, 128, 112, 112]               0
        Upsample-355        [-1, 128, 224, 224]               0
          Conv2d-356         [-1, 64, 224, 224]          73,792
     BatchNorm2d-357         [-1, 64, 224, 224]             128
            ReLU-358         [-1, 64, 224, 224]               0
            ReLU-359         [-1, 64, 224, 224]               0
            ReLU-360         [-1, 64, 224, 224]               0
            ReLU-361         [-1, 64, 224, 224]               0
            ReLU-362         [-1, 64, 224, 224]               0
            ReLU-363         [-1, 64, 224, 224]               0
            ReLU-364         [-1, 64, 224, 224]               0
            ReLU-365         [-1, 64, 224, 224]               0
            ReLU-366         [-1, 64, 224, 224]               0
            ReLU-367         [-1, 64, 224, 224]               0
            ReLU-368         [-1, 64, 224, 224]               0
            ReLU-369         [-1, 64, 224, 224]               0
            ReLU-370         [-1, 64, 224, 224]               0
            ReLU-371         [-1, 64, 224, 224]               0
            ReLU-372         [-1, 64, 224, 224]               0
            ReLU-373         [-1, 64, 224, 224]               0
 ReflectionPad2d-374         [-1, 64, 230, 230]               0
          Conv2d-375          [-1, 3, 224, 224]           9,411
================================================================
Total params: 55,051,779
Trainable params: 55,051,779
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 2409.92
Params size (MB): 210.01
Estimated Total Size (MB): 2620.50
----------------------------------------------------------------
